In [1]:
# import the pandas library..
import pandas as pd

In [2]:
# DataFrame:
# using dictionary and 2-d numpy array..
d1 = {'Name':['Lalitha','Nethra','Ganesh'],
     'RNO':[510,423,222],
     'Branch':['CSE','ECE','EEE']}
df = pd.DataFrame(d1)
df

      Name  RNO Branch
0  Lalitha  510    CSE
1   Nethra  423    ECE
2   Ganesh  222    EEE

### Updation operation:
- using replace() method
- 1. To update the single date:
        df.replace(old_data,new_data)
- 2. To update the mutliple data:
        df.replace(to_replace=[value1,value2...],
                    values=[new_value1,new_value2..])
- using loc&iloc indexing.

In [5]:
# To update the single data..
df
df.replace(423,444,inplace=True)
df

      Name  RNO Branch
0  Lalitha  510    CSE
1   Nethra  444    ECE
2   Ganesh  222    EEE

In [7]:
# To update the multiple data..
df.replace(to_replace=['Ganesh',222,'EEE'],
          value=['krishna',310,'MECH'],
          inplace=True)
df

      Name  RNO Branch
0  Lalitha  510    CSE
1   Nethra  444    ECE
2  krishna  310   MECH

#### Difference loc and iloc:
- loc: label name based location
        df.loc[row_index,column_name]
- iloc : integer based location
        df.iloc[row_index,column_index]

In [8]:
df

      Name  RNO Branch
0  Lalitha  510    CSE
1   Nethra  444    ECE
2  krishna  310   MECH

In [9]:
df.loc[0,'Branch']='EEE'
# Using loc
df

      Name  RNO Branch
0  Lalitha  510    EEE
1   Nethra  444    ECE
2  krishna  310   MECH

In [10]:
# using iloc to update the value...
df.iloc[0,1]=222
df

      Name  RNO Branch
0  Lalitha  222    EEE
1   Nethra  444    ECE
2  krishna  310   MECH

In [11]:
df

      Name  RNO Branch
0  Lalitha  222    EEE
1   Nethra  444    ECE
2  krishna  310   MECH

In [13]:
df[['Name','Branch']]
# To print the specific column records..

      Name Branch
0  Lalitha    EEE
1   Nethra    ECE
2  krishna   MECH

In [17]:
# To print the specific row records..
df.iloc[[1,2]]

      Name  RNO Branch
1   Nethra  444    ECE
2  krishna  310   MECH

In [20]:
# To print the specific rows and specific columns?
df.iloc[[0,1],[1,0]]

   RNO     Name
0  222  Lalitha
1  444   Nethra